{
  "asteria": {
    "title": "Asteria",
    "date": "July '25",
    "tools": ["Python","TypeScript","Next.js","Tailwind", "CrewAI", "FastAPI", "Vercel"],
    "deployment": "https://github.com/adahe8/bizhacks",
    "article-header": "The Duct-Taped Nature of Making Very Impressive Looking AI Projects on a Severe Time Crunch. AKA, How We Won a Hackathon with Vibe Coding",
    "description": [
        "Asteria is an agentic AI application that automates the full marketing pipeline for products from start to finish based on some user supplied information, tailoring the ads displayed across different channels, and altering budget lines, that I created with teammates Hannah Nguyen and Ethan Kallett.",
        "We ideated the project as a team over a span of 6 hours, planning functionality and feature ideas with feverish whiteboard scribbles, and outlined architectures for it with the help of LLMs. I worked on the technical implementation side, coding (in Python) the orchestration agent within the agent swarm (which we used CrewAI to set up), and assisting with refinements for the frontend. This project, created across a span of 36 hours for a hackathon and business case competition, was my first time dabbling into “vibe coding”, or heavily leveraging large language models as part of my development workflow. We used Anthropic's Claude model to support our process.",
        "As a result, my team unanimously agrees that this project is a compelling proof of concept, but it is far from being a secure and usable application. Because we grounded our solution in real world complaints, and presented a compelling market analysis with where our project fit in it, this vibe-coded, speed-debugged baby that surely still had uncaught usability errors won us second place in Infosys' annual company hackathon, out of a pool of 33 teams. However, it's more of an demonstration of our creative ideation of technical solutions, ability to sell a pitch, adeptness in learning the basics of building with agentic AI quickly, and fluency in reading and debugging TypeScript, Tailwind CSS, and Python code, than a demonstration of sound process. The rapid build period required for any hackathon though, may inherently make a rigorous process impossible.",
        "One last major takeaway from this project is an awareness of the pros and cons of vibe coding. Pros: with AI, you can rapidly spin up complex feature prototypes and change UIs with a single prompt. Cons: however, the generated features usually never work on the first try, and many bugs require human diagnosis. The problem with this is that LLMs can take things where you can't follow very quickly, and finding those issues will feel like trying to read directional signs in a foreign language. I've now seen enough AI generated interfaces to know that they share qualities like a tendency to favor card components, dialog boxes, rounded edges, gradient colors, and linear grid layouts. There's a particular sort of aesthetic common to these interfaces that  call “GPT polish”."
    ],
    "supplementary": {}
  },
  "ask-us": {
    "title": "Chat w/ a Librarian Widget",
    "date": "Nov '23 - March '24",
    "tools": ["Figma", "JIRA", "Confluence"],
    "deployment": "https://library.ucsd.edu/",
    "article-header": "Redesigning UC San Diego Library's Digital Experiences",
    "description": [
        "UC San Diego Library's website has historically had a chat widget that stays in the bottom right corner for every visitor. Clicking the icon opens a form widget for 24/7 support from a librarian. Since the website was revamped in 2018, and brand guidelines were defined, that button's design has phased out of date. Over the course of roughly 3 months, I refreshed the design of this icon and widget to reflect brand guidelines.",
        "This was the first web redesign project I conducted for UC San Diego Library. I served as the design lead, organizing the design files on Figma, documenting our process, collaborating with and directing other student designers during our Figma prototyping sessions and presentations to stakeholders, and finally communicating with the frontend developers to implement the selected icon and widget design.",
        "The live deployment is visible on the Library website; you will see it immediately in the right corner."
    ],
    "supplementary": {
        "type": "image",
        "src": "assets/ask-us-changes.png",
        "caption": "Before redesign (left) vs after redesign (right)"
    }
  },
  "endowments": {
    "title": "Endowments Webpages",
    "date": "Oct '24 - June '25",
    "tools": ["Figma","JIRA","Confluence", "HTML", "CSS", "JS", "Github"],
    "deployment": "",
    "article-header": "On Atomic Design & End-to-End Development",
    "description": [
        "To honor donors and provide an easy way to look up what endowments (AKA monetary grants) to the UC San Diego Library went towards, the Library web committee asked my team, the Technology & Digital Experience (TDX) department, to create webpages for each unique endowment, and an index page organizing all of them. I took on the project with my team's frontend engineer, Christoper Lopez.",
        "This was an intensive end-to-end project that involved live user research, design spectrums, and code contributions. We needed to create 2 types of webpages: the webpage for each endowment, and the index page showcasing the list of endowments. For the donation page template, I began sketching on Figma with a basic page structure for an informational webpage from the UC San Diego Library's design system, but it still needed to be customized specialized components. For the index page, we needed to create a specialized search bar, a featured cards component, and designs for the list of endowments. Here, I  forayed into atomic design, or starting with sketching designs of the smallest useful units within a component before building up sketches for the full unit. This meant developing variants of endowments “cards” for the index page, before composing those variants into variations of designs for the featured endowments gallery or endowments lists. I did this process for each complex component, breaking them down into units and designing from the units up, until we had spectra of designs for each type of page ranging from minimalist to maximalist design.",
        "Atomic design takes time. But the rigor and choice it offers is unparalleled, because you emerge with a series of options that can be tested! This was the stage where we reported to stakeholders and brought in users and the rest of the student design team; after repeated rounds of feedback, iteration, and voting, we settled on final designs.",
        "At this point, I could tell that my fluency in Figma had vastly improved. Using autolayout to make designs responsive came easily to me; Figma inheritance made enough sense that I no longer ran into the situation where I had to edit every single instance of a component because I'd forgotten to pull from the original instance. I'd used Figma prototyping mode to create demos for stakeholders, that would prove how our design would work on the website.",
        "So I was feeling pretty pleased with myself! Then, Chris launched us into the development phase; over the course of 2 unique 2 week sprints, we built out HTML/CSS/JS mockups for the designed templates that we then put into the library's CMS. The library's standard is to use BEM naming conventions for CSS, so I was able to practice that. I loved getting exposure to the Agile process that I had been learning about from my Software Engineering class; overall, Agile felt efficient and constructive for a project with very clearly defined specs (thanks to our rigorous design phase) and a small team.",
        "Since the page templates now exist within the CMS, we only need stakeholders to finish compiling all the requested data for each endowment before entering it in and live-deploying these pages. Exiting this project, I'm confidently an atomic design truther, and aware of what an end-to-end development process looks like. Having owned a project and set of features from ideation and design to development, it's evident that interdisciplinary thinking (particularly designing with the awareness of best development practices, and developing with awareness of design intentions) and ability to communicate across design, engineering, and academic + business stakeholders, are critical aspects of the design engineer's toolkit."
    ],
    "supplementary":{}
  },
  "website": {
   "title": "Personal Website",
    "date": "Oct '25 - Present",
    "tools": ["Figma","HTML","CSS","JS","Astro","Cloudflare"],
    "deployment": "https://cse134b-hw4-1z1.pages.dev/",
    "article-header": "",
    "description": [
        "My personal website is an exercise in revisiting first principles and following the progressive enhancement strategy of web development, starting by writing out content with basic principles of good semantic markup, before building up by adding interactivity, special features like the theme toggle, and offline functionality via service workers.",
        "This variation demonstrates how far vanilla HTML, CSS (complete with its vast variety of APIs), and JavaScript can take you; frameworks like React and Next.js are so popular right now, but we don’t often consider the tradeoffs that come with them. What you see right now is an demonstration of how the functionality I aim for when developing with frameworks are achievable using the simplest baseline tools.",
        "Some quirks of this website: a lot of the code for my earlier web projects was cursed by div-itis, so I’ve been avoiding divs where I can in favor of custom tags and proper semantic tags. This project inspired me to intensively study CSS animations, and I found that I built up a lot more fluency with HTML, CSS, and JS best practices that boost performance and accessibility as a result! Next, my goal is to set up a custom CMS to make posting and editing this site easy, before reconstructing it with frameworks, and cross-comparing performance."
    ]
  },
  "supplementary": {}
}